InformationRegisters/СохраненияВосхождения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СохраненияВосхождения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХранилищеСохранения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СохраненияВосхождения/Ext/ManagerModule.bsl
// Сохраняет данные восхождения пользователя.
//
// Параметры:
//  ДанныеВосхождения - Структура - данные для сохранения:
//   - Пользователь - СправочникСсылка.Пользователи - пользователь
//   - ПараметрыИгрока - Таблица - параметры игрока
//   - КолодаИгрока - Таблица - колода игрока
//   - Модификаторы - Таблица - модификаторы
//   - НомерЭтапа - Число - номер этапа
//  ПользовательВход - СправочникСсылка.Пользователи - (необязательно) пользователь для сохранения
Процедура СохранитьВосхождениеПользователя(ДанныеВосхождения, ПользовательВход = Неопределено) Экспорт
	Попытка
		ТекПользователь = ОбщегоНазначенияВызовСервера.ТекущийПользователь();
		ПользовательРабочий = ТекПользователь;
		Если ЗначениеЗаполнено(ПользовательВход) Тогда
			ПользовательРабочий = ПользовательВход;
		Иначе
			ПользовательРабочий = ТекПользователь;
		КонецЕсли;
		Запись = РегистрыСведений.СохраненияВосхождения.СоздатьМенеджерЗаписи();
		Запись.Пользователь = ПользовательРабочий;
		Запись.ХранилищеСохранения = Новый ХранилищеЗначения(ДанныеВосхождения);
		Запись.Записать();
	Исключение
		Сообщить("Не удалось сохранить восхождение пользователя " + Строка(ПользовательРабочий));
	КонецПопытки;
КонецПроцедуры
	
// Получает сохранение восхождения пользователя.
//
// Параметры:
//  ПользовательВход - СправочникСсылка.Пользователи - пользователь для поиска сохранения
//
// Возвращаемое значение:
//  Структура - результат поиска:
//   - СохранениеНайдено - Булево - флаг найденного сохранения
//   - ХранилищеСохранения - ХранилищеЗначения - хранилище с данными сохранения (если найдено)
Функция ПолучитьСохранениеВосхождения(ПользовательВход) Экспорт
	// Инициализация.
	Результат = Новый Структура();
	Результат.Вставить("СохранениеНайдено", Ложь);
	Результат.Вставить("ХранилищеСохранения", Неопределено);
	Попытка
		// Получение параметров.
		ТекПользователь = ОбщегоНазначенияВызовСервера.ТекущийПользователь();
		ПользовательРабочий = ТекПользователь;
		Если ЗначениеЗаполнено(ПользовательВход) Тогда
			ПользовательРабочий = ПользовательВход;
		Иначе
			// Пользователь уже получен.
		КонецЕсли;
		// Получение данных из БД.
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СохраненияВосхождения.Пользователь КАК Пользователь,
		|	СохраненияВосхождения.ХранилищеСохранения КАК ХранилищеСохранения
		|ИЗ
		|	РегистрСведений.СохраненияВосхождения КАК СохраненияВосхождения
		|ГДЕ
		|	СохраненияВосхождения.Пользователь = &Пользователь";
		Запрос.УстановитьПараметр("Пользователь", ПользовательВход);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			// Вывод результата.
			Результат.СохранениеНайдено		 = Истина;
			Результат.ХранилищеСохранения	 = ВыборкаДетальныеЗаписи.ХранилищеСохранения;
		КонецЦикла;
	Исключение
		Сообщить("Не удалось получить сохранение восхождения пользователя " + Строка(ПользовательРабочий));
	КонецПопытки;
	Возврат Результат;
КонецФункции
